Revit 2024 API
ConnectorDomainType Enumeration
 Type of connector domain.
 Enumeration of connector domain types
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum ConnectorDomainType
Visual Basic
Public Enumeration ConnectorDomainType
Visual C++
public enum class ConnectorDomainType
Members
Member name | Description
Undefined |  Domain is undefined
Hvac |  HVAC (duct) connector
Electrical |  Electrical connector
Piping |  Piping connector
CableTrayConduit |  Connector of cable trays or conduits
StructuralAnalytical |  Connector of Structural Analytical Model
See Also
Autodesk.Revit.DB Namespace